#+TITLE: dragonruby resources

** Splat operator
To have a splat oprator we need to overload the `to_a` operator:

#+begin_src ruby :session
  class Vec3
    def initialize x, y, z
      @arr = [x, y, z]
    end

    def to_a
      @arr
    end
  end

  v = Vec3.new 2, 3, 4

  p *v
#+end_src

#+RESULTS:
| 2 | 3 | 4 |

** Matrix Multiplication
Matrix multiplication is pretty trivial in Ruby.

#+begin_src ruby :session
  def matmul mat1, mat2
    mat1.collect do |row1|
      mat2.transpose.collect do |col1|
        col1.zip(row1).inject(0) do |sum, pair|
          sum + pair[0] * pair[1]
        end
      end
    end
  end

  a = [[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]]
  b = [[7, 8], [9, 10], [11, 12]]

  matmul a, b
#+end_src

#+RESULTS:
|  58 |  64 |
| 139 | 154 |
| 220 | 244 |
| 301 | 334 |

